[M_RiggedRace MissionDefinition]
MissionDescription="With the clan war kicked into high gear, Mick Zaford has asked you to crash the Hodunk's beloved auto race and use explosives to destroy every car on the track."
TurnInDescription="The Zafords have struck -- it's up to the Hodunks to strike back."
